import type { Category } from "../types";

export const wudu: Category = {
  slug: "wudu",
  title: "أذكار الوضوء",
  adhkar: [
    {
      id: "wudu-1",
      text: "بِسْمِ اللَّهِ",
      count: 1,
      note: "ذكر قبل الوضوء",
    },
    {
      id: "wudu-2",
      text: "أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ ، اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ ، سُبْحانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ وَأَتوبُ إِلَيْكَ.",
      count: 1,
      note: "ذكر بعد الوضوء",
    },
  ],
};
